{
"flashcards": [ 
    {
        "term":"Algorithm",
        "summary":"A set of well-defined , step by step instructions to solve a particular problem or perform a computation."
    },
    {
        "term":"Data type",
        "summary":"The classification of different types of data."
    },
    {
        "term":"Variable",
        "summary":"a named storage location in a computers memory that holds a value."
    },
    {
        "term":"Operator",
        "summary":"Symbols () that represent actions or processes to be preformed on operands. ( variables = values) "
    },    
    {
        "term":"Control Flow",
        "summary":"The order in which a program's instructions are executed, determined by conditional statements and loops."
    },    
    {
        "term":"Conditional statement",
        "summary":"Code that performs a different action depending on weather a programmer-specified boolean condition is true or false."
    },    
    {
        "term":"Loop",
        "summary":"A control structure that repeatedly executes a block of code until a certain condition is met."
    },    
    {
        "term":"Function (method)",
        "summary":"A block of code that performs a specific task and can be called by name."
    },    
    {
        "term":"Argument",
        "summary":"The value or expression passed into a function when it is called."
    },    
    {
        "term":"Syntax",
        "summary":"the set of rules that defines the structure of a programming language, similar to grammar in human language."
    },    
    {
        "term":"Keyword (reserved word)",
        "summary":"A word reserved by a programming language that has a special meaning and cannot be used as a variable name."
    },    
    {
        "term":"Program",
        "summary":"A collection of source code files that can be executed by a computer to perform a specific task."
    },    
    {
        "term":"Source Code",
        "summary":"Human-readable code written by a programmer."
    },    
    {
        "term":"Compiler",
        "summary":"A program that translates source code written in a high-level language into machine code that a computer can execute."
    },    
    {
        "term":"Interpreter",
        "summary":"A program thar executes source code line by line without first compiling it into machine code."
    },    
    {
        "term":"Debugging",
        "summary":"The process of identifying , analyzing and fixing bugs or errors in a computer program."
    },    
    {
        "term":"API ( Application Programming Interface",
        "summary":"A set of rules and protocols that allows different software applications to communicate with each other."
    },    
    {
        "term":"Library",
        "summary":"A collection of pre-written functions, classes , or modules that developers can use to perform common tasks."
    },    
    {
        "term":"Framework",
        "summary":"A pre-built structure of code that provides a foundation for building an application."
    },    
    {
        "term":"Version Control" ,
        "summary":"A system that records changes to a file or set of files overtime, making it easier to track and revert changes."
    },    
    {
        "term":"IDE (Integrated Development Environment)",
        "summary":"Software that provides comprehensive tools for software development, such as a code editor, compiler, debugger etc.."
    },    
    {
        "term":"",
        "summary":""
    }
 ]
}
    